; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v7 - type_3 ?v4 - type_2)
 	      (pred_1 ?v5 - object ?v4 - type_2)
	      (pred_3 ?v7 - type_3 ?v2 - type_1)
	      (pred_2 ?v7 - type_3 ?v5 - object ?v2 - type_1))

   (:action op_1
       :parameters  (?v7 - type_3 ?v6 ?v1 - type_2)
       :precondition (and  (pred_4 ?v7 ?v6))
       :effect (and  (pred_4 ?v7 ?v1)
		     (not (pred_4 ?v7 ?v6))))

   (:action op_3
       :parameters (?v7 - type_3 ?v8 - object ?v3 - type_2 ?v2 - type_1)
       :precondition  (and  (pred_1 ?v8 ?v3) (pred_4 ?v7 ?v3) (pred_3 ?v7 ?v2))
       :effect (and (pred_2 ?v7 ?v8 ?v2)
		    (not (pred_1 ?v8 ?v3)) 
		    (not (pred_3 ?v7 ?v2))))

   (:action op_2
       :parameters (?v7 - type_3 ?v8 - object ?v3 - type_2 ?v2 - type_1)
       :precondition  (and  (pred_2 ?v7 ?v8 ?v2) (pred_4 ?v7 ?v3))
       :effect (and (pred_1 ?v8 ?v3)
		    (pred_3 ?v7 ?v2)
		    (not (pred_2 ?v7 ?v8 ?v2)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_05 - type_3
obj_08 obj_01 - type_1
obj_04 obj_03 obj_07 obj_06 - type_2
obj_02 obj_10 obj_09 - object)
(:init
(pred_4 obj_05 obj_06)
(pred_3 obj_05 obj_08)
(pred_3 obj_05 obj_01)
(pred_1 obj_02 obj_07)
(pred_1 obj_10 obj_06)
(pred_1 obj_09 obj_06)
)
(:goal
(and
(pred_1 obj_02 obj_07)
(pred_1 obj_10 obj_04)
(pred_1 obj_09 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_05 ?b obj_08))))
)
)

; plan
1. (op_3 obj_05 obj_09 obj_06 obj_01)
   deleted: (pred_1 obj_09 obj_06) (pred_3 obj_05 obj_01)
   added: (pred_2 obj_05 obj_09 obj_01)
   goals met: 1 of 3
2. (op_1 obj_05 obj_06 obj_07)
   deleted: (pred_4 obj_05 obj_06)
   added: (pred_4 obj_05 obj_07)
   goals met: 1 of 3
3. (op_2 obj_05 obj_09 obj_07 obj_01)
   deleted: (pred_2 obj_05 obj_09 obj_01)
   added: (pred_1 obj_09 obj_07) (pred_3 obj_05 obj_01)
   goals met: 2 of 3
4. (op_1 obj_05 obj_07 obj_04)
   deleted: (pred_4 obj_05 obj_07)
   added: (pred_4 obj_05 obj_04)
   goals met: 2 of 3
5. (op_1 obj_05 obj_04 obj_06)
   deleted: (pred_4 obj_05 obj_04)
   added: (pred_4 obj_05 obj_06)
   goals met: 2 of 3
6. (op_3 obj_05 obj_10 obj_06 obj_01)
   deleted: (pred_1 obj_10 obj_06) (pred_3 obj_05 obj_01)
   added: (pred_2 obj_05 obj_10 obj_01)
   goals met: 2 of 3
7. (op_1 obj_05 obj_06 obj_04)
   deleted: (pred_4 obj_05 obj_06)
   added: (pred_4 obj_05 obj_04)
   goals met: 2 of 3
8. (op_2 obj_05 obj_10 obj_04 obj_01)
   deleted: (pred_2 obj_05 obj_10 obj_01)
   added: (pred_1 obj_10 obj_04) (pred_3 obj_05 obj_01)
   goals met: 3 of 3
